<?xml version="1.0"?>
<net name="Model51" version="11">
	<layers>
		<layer id="0" name="x" type="Parameter" version="opset1">
			<data shape="?,?" element_type="i64" />
			<output>
				<port id="0" precision="I64" names="x">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="__module.transformer.roberta.encoder.layers.23.mlp/aten::empty/Convert_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="0" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="2" name="__module.transformer.roberta.encoder.layers.23.mlp/aten::empty/Convert" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="3" name="__module.transformer.roberta.embeddings/aten::size/ShapeOf" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Constant_341392" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="2" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="__module.transformer.roberta.embeddings/prim::ListConstruct" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="__module.transformer.roberta.encoder.layers.23.mlp/aten::empty/Broadcast_1" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1023_1,1113_1,1263_1,1353_1,1503_1,1593_1,1743_1,1833_1,1983_1,2073_1,2223_1,2313_1,2463_1,2553_1,2703_1,2793_1,2943_1,3033_1,303_2,3183_1,3273_1,3423_1,3513_1,3663_1,3753_1,3903_1,393_1,3993_1,4143_1,4233_1,4383_1,4473_1,4623_1,4713_1,4863_1,4953_1,5103_1,5193_1,5343_1,5433_1,543_1,5583_1,5673_1,5823_1,5913_1,633_1,69_1,783_1,873_1">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="aten::full/Convert" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="10" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="8" name="Constant_674382" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="14" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Constant_674383" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="14" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="10" name="Gather_674384" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="66,6_1,8">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="aten::full/Broadcast" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<input>
				<port id="0" precision="I32" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32" names="15_1">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="__module.transformer.roberta.embeddings/aten::_unique2/Unique" type="Unique" version="opset10">
			<data sorted="true" index_element_type="i64" count_element_type="i64" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32" names="1017,104_1,1066,1107,1164,1257,1306,1347,1404,1497,1546,1587,1644,1737,1786,1827,1884,1977,2026,204_1,2067,2124,2217,2266,2307,2364,2457,2506,2547,2604,2697,2746,2787,2844,2937,297_2,2986,3027,3084,3177,3226,3267,3324,3417,3466,346_2,3507,3564,3657,3706,3747,3804,387,3897,3946,3987,4044,4137,4186,4227,4284,4377,4426,444,4467,4524,4617,4666,4707,4764,4857,4906,4947,5004,5097,5146,5187,5244,5337,537,5386,5427,5484,5577,5626,5667,5724,5817,586,5866,5907,627,63_1,684,777,826,867,924">
					<dim>-1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>-1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>-1</dim>
				</port>
				<port id="4" precision="I64">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="33" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="14" size="8" />
			<output>
				<port id="0" precision="I64" names="33_1" />
			</output>
		</layer>
		<layer id="14" name="__module.transformer.roberta.embeddings/prim::ListUnpack/Squeeze" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I32" names="1025,1074,108_1,1115,1172,1265,1314,1355,1412,1505,1554,1595,1652,1745,1794,1835,1892,1985,2034,2075,212,2132,2225,2274,2315,2372,2465,2514,2555,2612,2705,2754,2795,2852,2945,2994,3035,305_2,3092,3185,3234,3275,3332,3425,3474,3515,354,3572,3665,3714,3755,3812,3905,395,3954,3995,4052,4145,4194,4235,4292,4385,4434,4475,452,4532,4625,4674,4715,4772,4865,4914,4955,5012,5105,5154,5195,5252,5345,5394,5435,545,5492,5585,5634,5675,5732,5825,5874,5915,594,635,692,71_1,785,834,875,932,task_id,task_id.101,task_id.103,task_id.105,task_id.107,task_id.109,task_id.11,task_id.111,task_id.113,task_id.115,task_id.117,task_id.119,task_id.121,task_id.123,task_id.125,task_id.127,task_id.129,task_id.13,task_id.131,task_id.133,task_id.135,task_id.137,task_id.139,task_id.141,task_id.143,task_id.145,task_id.147,task_id.149,task_id.15,task_id.151,task_id.153,task_id.155,task_id.157,task_id.159,task_id.161,task_id.163,task_id.165,task_id.167,task_id.169,task_id.17,task_id.171,task_id.173,task_id.175,task_id.177,task_id.179,task_id.181,task_id.183,task_id.185,task_id.187,task_id.189,task_id.19,task_id.191,task_id.21,task_id.23,task_id.25,task_id.27,task_id.29,task_id.3,task_id.31,task_id.33,task_id.35,task_id.37,task_id.39,task_id.41,task_id.43,task_id.45,task_id.47,task_id.49,task_id.51,task_id.53,task_id.55,task_id.57,task_id.59,task_id.61,task_id.63,task_id.65,task_id.67,task_id.69,task_id.7,task_id.71,task_id.73,task_id.75,task_id.77,task_id.79,task_id.81,task_id.83,task_id.85,task_id.87,task_id.89,task_id.9,task_id.91,task_id.93,task_id.95,task_id.97,task_id.99" />
			</output>
		</layer>
		<layer id="15" name="__module.transformer.roberta.embeddings/aten::eq/Equal" type="Equal" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32" />
			</input>
			<output>
				<port id="2" precision="BOOL" names="1028,1077,1118,1175,1268,1317,132_1,1358,1415,1508,1557,1598,1655,1748,1797,1838,1895,1988,2037,2078,2135,215_1,2228,2277,2318,2375,2468,2517,2558,2615,2708,2757,2798,2855,2948,2997,3038,308_2,3095,3188,3237,3278,3335,3428,3477,3518,357,3575,3668,3717,3758,3815,3908,3957,398,3998,4055,4148,4197,4238,4295,4388,4437,4478,4535,455,4628,4677,4718,4775,4868,4917,4958,5015,5108,5157,5198,5255,5348,5397,5438,548,5495,5588,5637,5678,5735,5828,5877,5918,597,638,695,74_1,788,837,878,935">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="__module.transformer.roberta.embeddings/prim::ListUnpack/NonZero" type="NonZero" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="BOOL">
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Constant_445685" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="10" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="18" name="__module.transformer.roberta.embeddings/prim::ListUnpack/Squeeze_1" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32" />
			</input>
			<output>
				<port id="2" precision="I64" names="1030,1079,1120,1177,1270,1319,134_1,1360,1417,1510,1559,1600,1657,1750,1799,1840,1897,1990,2039,2080,2137,217_1,2230,2279,2320,2377,2470,2519,2560,2617,2710,2759,2800,2857,2950,2999,3040,3097,310_2,3190,3239,3280,3337,3430,3479,3520,3577,359,3670,3719,3760,3817,3910,3959,400,4000,4057,4150,4199,4240,4297,4390,4439,4480,4537,457,4630,4679,4720,4777,4870,4919,4960,5017,5110,5159,5200,5257,5350,5399,5440,5497,550,5590,5639,5680,5737,5830,5879,5920,599,640,697,76,790,839,880,937,task_indices,task_indices.1,task_indices.101,task_indices.103,task_indices.105,task_indices.107,task_indices.109,task_indices.11,task_indices.111,task_indices.113,task_indices.115,task_indices.117,task_indices.119,task_indices.121,task_indices.123,task_indices.125,task_indices.127,task_indices.129,task_indices.13,task_indices.131,task_indices.133,task_indices.135,task_indices.137,task_indices.139,task_indices.141,task_indices.143,task_indices.145,task_indices.147,task_indices.149,task_indices.15,task_indices.151,task_indices.153,task_indices.155,task_indices.157,task_indices.159,task_indices.161,task_indices.163,task_indices.165,task_indices.167,task_indices.169,task_indices.17,task_indices.171,task_indices.173,task_indices.175,task_indices.177,task_indices.179,task_indices.181,task_indices.183,task_indices.185,task_indices.187,task_indices.189,task_indices.19,task_indices.191,task_indices.193,task_indices.21,task_indices.23,task_indices.25,task_indices.27,task_indices.29,task_indices.31,task_indices.33,task_indices.35,task_indices.37,task_indices.39,task_indices.41,task_indices.43,task_indices.45,task_indices.47,task_indices.49,task_indices.51,task_indices.53,task_indices.55,task_indices.57,task_indices.59,task_indices.61,task_indices.63,task_indices.65,task_indices.67,task_indices.69,task_indices.71,task_indices.73,task_indices.75,task_indices.77,task_indices.79,task_indices.81,task_indices.83,task_indices.85,task_indices.87,task_indices.89,task_indices.9,task_indices.91,task_indices.93,task_indices.95,task_indices.97,task_indices.99">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Convert_676752" type="Convert" version="opset1">
			<data destination_type="i32" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Constant_475131" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="10" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="21" name="__module.transformer.roberta.encoder.layers.23.mlp/aten::index_put_/Gather_1" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
				<port id="1" precision="I32" />
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="I32" />
			</output>
		</layer>
		<layer id="22" name="__module.transformer.roberta.encoder.layers.23.mlp/aten::index_put_/ConvertLike_2" type="Convert" version="opset1">
			<data destination_type="i64" />
			<input>
				<port id="0" precision="I32" />
			</input>
			<output>
				<port id="1" precision="I64" />
			</output>
		</layer>
		<layer id="23" name="__module.transformer.roberta.encoder.layers.23.mlp/aten::index_put_/Add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="__module.transformer.roberta.encoder.layers.23.mlp/aten::index_put_/Mod_1" type="Mod" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Constant_475134" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="22" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="26" name="__module.transformer.roberta.encoder.layers.23.mlp/aten::index_put_/Unsqueeze_1" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32" />
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="__module.transformer.roberta.encoder.layers.23.mlp/aten::empty/Convert_1_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="0" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="28" name="__module.transformer.roberta.encoder.layers.23.mlp/aten::empty/Convert_1" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="29" name="Constant_344955" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="26" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="__module.transformer.roberta.encoder.layers.0.mlp/prim::ListConstruct" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="__module.transformer.roberta.encoder.layers.23.mlp/aten::empty/Broadcast" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1072_1,1312_1,1552_1,1792_1,2032_1,2272_1,2512_1,2752_1,2992_1,3232_1,3472_1,352_1,3712_1,3952_1,4192_1,4432_1,4672_1,4912_1,5152_1,5392_1,5632_1,5872_1,592_1,832_1">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>4096</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Convert_676739" type="Convert" version="opset1">
			<data destination_type="i32" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Constant_475107" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="10" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="34" name="__module.transformer.roberta.encoder.layers.23.mlp/aten::index_put_/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
				<port id="1" precision="I32" />
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="I32" />
			</output>
		</layer>
		<layer id="35" name="__module.transformer.roberta.encoder.layers.23.mlp/aten::index_put_/ConvertLike" type="Convert" version="opset1">
			<data destination_type="i64" />
			<input>
				<port id="0" precision="I32" />
			</input>
			<output>
				<port id="1" precision="I64" />
			</output>
		</layer>
		<layer id="36" name="__module.transformer.roberta.encoder.layers.23.mlp/aten::index_put_/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="__module.transformer.roberta.encoder.layers.23.mlp/aten::index_put_/Mod" type="Mod" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Constant_475110" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="22" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="39" name="__module.transformer.roberta.encoder.layers.23.mlp/aten::index_put_/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32" />
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="__module.transformer.roberta.encoder.layers.23.mixer/aten::empty/Convert_1_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="0" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="41" name="__module.transformer.roberta.encoder.layers.23.mixer/aten::empty/Convert_1" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="42" name="Constant_341637" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="34" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="__module.transformer.roberta.encoder.layers.0.mixer/prim::ListConstruct" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="__module.transformer.roberta.encoder.layers.23.mixer/aten::empty/Broadcast" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1170_1,1410_1,1650_1,1890_1,210_1,2130_1,2370_1,2610_1,2850_1,3090_1,3330_1,3570_1,3810_1,4050_1,4290_1,450_1,4530_1,4770_1,5010_1,5250_1,5490_1,5730_1,690_1,930_1">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>3072</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Convert_676667" type="Convert" version="opset1">
			<data destination_type="i32" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="Constant_475059" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="10" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="47" name="__module.transformer.roberta.encoder.layers.23.mixer/aten::index_put_/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
				<port id="1" precision="I32" />
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="I32" />
			</output>
		</layer>
		<layer id="48" name="__module.transformer.roberta.encoder.layers.23.mixer/aten::index_put_/ConvertLike" type="Convert" version="opset1">
			<data destination_type="i64" />
			<input>
				<port id="0" precision="I32" />
			</input>
			<output>
				<port id="1" precision="I64" />
			</output>
		</layer>
		<layer id="49" name="__module.transformer.roberta.encoder.layers.23.mixer/aten::index_put_/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="__module.transformer.roberta.encoder.layers.23.mixer/aten::index_put_/Mod" type="Mod" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Constant_475062" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="22" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="52" name="__module.transformer.roberta.encoder.layers.23.mixer/aten::index_put_/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32" />
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="self.transformer.roberta.embeddings.word_embeddings.parametrizations.weight.original_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="250002, 1024" offset="42" size="512004096" />
			<output>
				<port id="0" precision="FP16" names="self.transformer.roberta.embeddings.word_embeddings.parametrizations.weight.original">
					<dim>250002</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="self.transformer.roberta.embeddings.word_embeddings.parametrizations.weight.original" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>250002</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>250002</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="self.transformer.roberta.embeddings.word_embeddings.parametrizations.weight.0.lora_A_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 250002, 4" offset="512004138" size="2000016" />
			<output>
				<port id="0" precision="FP16" names="self.transformer.roberta.embeddings.word_embeddings.parametrizations.weight.0.lora_A">
					<dim>1</dim>
					<dim>250002</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="self.transformer.roberta.embeddings.word_embeddings.parametrizations.weight.0.lora_A" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>250002</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>250002</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="__module.transformer.roberta.embeddings.word_embeddings/aten::Int/Convert" type="Convert" version="opset1">
			<data destination_type="i64" />
			<input>
				<port id="0" precision="I32" />
			</input>
			<output>
				<port id="1" precision="I64" names="1026,1027,1075,1076,109_1,110_1,1116,1117,1173,1174,1266,1267,1315,1316,1356,1357,1413,1414,1506,1507,1555,1556,1596,1597,1653,1654,1746,1747,1795,1796,1836,1837,1893,1894,1986,1987,2035,2036,2076,2077,2133,2134,213_1,214_1,2226,2227,2275,2276,2316,2317,2373,2374,2466,2467,2515,2516,2556,2557,2613,2614,2706,2707,2755,2756,2796,2797,2853,2854,2946,2947,2995,2996,3036,3037,306_2,307_2,3093,3094,3186,3187,3235,3236,3276,3277,3333,3334,3426,3427,3475,3476,3516,3517,355,356,3573,3574,3666,3667,3715,3716,3756,3757,3813,3814,3906,3907,3955,3956,396,397,3996,3997,4053,4054,4146,4147,4195,4196,4236,4237,4293,4294,4386,4387,4435,4436,4476,4477,453,4533,4534,454,4626,4627,4675,4676,4716,4717,4773,4774,4866,4867,4915,4916,4956,4957,5013,5014,5106,5107,5155,5156,5196,5197,5253,5254,5346,5347,5395,5396,5436,5437,546,547,5493,5494,5586,5587,5635,5636,5676,5677,5733,5734,5826,5827,5875,5876,5916,5917,595,596,636,637,693,694,72_1,73_1,786,787,835,836,876,877,933,934" />
			</output>
		</layer>
		<layer id="58" name="__module.transformer.roberta.embeddings.word_embeddings/aten::select/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>250002</dim>
					<dim>4</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="91_1">
					<dim>250002</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="self.transformer.roberta.embeddings.word_embeddings.parametrizations.weight.0.lora_B_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 4, 1024" offset="514004154" size="8192" />
			<output>
				<port id="0" precision="FP16" names="self.transformer.roberta.embeddings.word_embeddings.parametrizations.weight.0.lora_B">
					<dim>1</dim>
					<dim>4</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="self.transformer.roberta.embeddings.word_embeddings.parametrizations.weight.0.lora_B" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>4</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>4</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="__module.transformer.roberta.embeddings.word_embeddings/aten::select/Gather_1" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>4</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="90_1">
					<dim>4</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="__module.transformer.roberta.embeddings.word_embeddings/aten::matmul/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>250002</dim>
					<dim>4</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>4</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="92_1,96,97_1">
					<dim>250002</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="__module.transformer.roberta.embeddings.word_embeddings/aten::add/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>250002</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>250002</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="98_1">
					<dim>250002</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="__module.transformer.roberta.embeddings/aten::index/Convert" type="Convert" version="opset1">
			<data destination_type="i32" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="__module.transformer.roberta.embeddings/aten::index/Constant" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="10" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="66" name="__module.transformer.roberta.embeddings/aten::index/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="I64" names="78_1">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="__module.transformer.roberta.embeddings.word_embeddings/aten::embedding/Convert" type="Convert" version="opset1">
			<data destination_type="i32" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="__module.transformer.roberta.embeddings.word_embeddings/aten::embedding/Constant" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="10" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="69" name="__module.transformer.roberta.embeddings.word_embeddings/aten::embedding/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>250002</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="FP32" names="99,task_embeddings">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="__module.transformer.roberta.embeddings/aten::index_put_/ShapeOf_0" type="ShapeOf" version="opset3">
			<data output_type="i32" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="Constant_472808" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="514012346" size="4" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="Constant_472805" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="514012350" size="4" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="Constant_472804" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="514012346" size="4" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Constant_472816" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="14" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="__module.transformer.roberta.embeddings/aten::index_put_/Slice" type="Slice" version="opset8">
			<input>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
				<port id="3" precision="I32">
					<dim>1</dim>
				</port>
				<port id="4" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="I32">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="__module.transformer.roberta.embeddings/aten::index_put_/Concat" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="__module.transformer.roberta.embeddings/aten::index_put_/Broadcast" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="__module.transformer.roberta.embeddings/aten::index_put_/ScatterNDUpdate" type="ScatterNDUpdate" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="I64">
					<dim>-1</dim>
					<dim>1</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32" names="69_2">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="__module.transformer.roberta.embeddings/aten::index/Constant_1" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="10" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="80" name="__module.transformer.roberta.embeddings/aten::index/Gather_1" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="FP32" names="136_1">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="self.transformer.roberta.embeddings.token_type_embeddings.parametrizations.weight.original_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1024" offset="514012354" size="2048" />
			<output>
				<port id="0" precision="FP16" names="self.transformer.roberta.embeddings.token_type_embeddings.parametrizations.weight.original">
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="self.transformer.roberta.embeddings.token_type_embeddings.parametrizations.weight.original" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="self.transformer.roberta.embeddings.token_type_embeddings.parametrizations.weight.0.lora_A_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 4" offset="514014402" size="8" />
			<output>
				<port id="0" precision="FP16" names="self.transformer.roberta.embeddings.token_type_embeddings.parametrizations.weight.0.lora_A">
					<dim>1</dim>
					<dim>1</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="self.transformer.roberta.embeddings.token_type_embeddings.parametrizations.weight.0.lora_A" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="__module.transformer.roberta.embeddings.token_type_embeddings/aten::select/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>4</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="123_1">
					<dim>1</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="self.transformer.roberta.embeddings.token_type_embeddings.parametrizations.weight.0.lora_B_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 4, 1024" offset="514014410" size="8192" />
			<output>
				<port id="0" precision="FP16" names="self.transformer.roberta.embeddings.token_type_embeddings.parametrizations.weight.0.lora_B">
					<dim>1</dim>
					<dim>4</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="self.transformer.roberta.embeddings.token_type_embeddings.parametrizations.weight.0.lora_B" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>4</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>4</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="__module.transformer.roberta.embeddings.token_type_embeddings/aten::select/Gather_1" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>4</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="122">
					<dim>4</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="__module.transformer.roberta.embeddings.token_type_embeddings/aten::matmul/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>4</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>4</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="124_1,128,129_1">
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="__module.transformer.roberta.embeddings.token_type_embeddings/aten::add/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="130_1">
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="__module.transformer.roberta.embeddings/aten::zeros/Convert" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="14" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="92" name="Constant_674395" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="514022602" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="Constant_674396" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="14" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="94" name="Gather_674397" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="1227,1231,1232,1467,1471,1472,1707,1711,1712,1947,1951,1952,218,2187,218_10,218_11,218_12,218_13,218_14,218_15,218_16,218_17,218_18,218_19,218_2,218_20,218_21,218_22,218_23,218_24,218_3,218_4,218_5,218_6,218_7,218_8,218_9,2191,2192,220,220_1,220_10,220_11,220_12,220_13,220_14,220_15,220_16,220_17,220_18,220_19,220_2,220_20,220_21,220_22,220_23,220_3,220_4,220_5,220_6,220_7,220_8,220_9,235,235_10,235_11,235_12,235_13,235_14,235_15,235_16,235_17,235_18,235_19,235_2,235_20,235_21,235_22,235_23,235_24,235_3,235_4,235_5,235_6,235_7,235_8,235_9,237,237_10,237_11,237_12,237_13,237_14,237_15,237_16,237_17,237_18,237_19,237_2,237_20,237_21,237_22,237_23,237_24,237_3,237_4,237_5,237_6,237_7,237_8,237_9,2427,2431,2432,2667,2671,2672,267_2,271_2,272_2,2907,2911,2912,3147,3151,3152,3387,3391,3392,3627,3631,3632,3867,3871,3872,4107,4111,4112,4347,4351,4352,4587,4591,4592,4827,4831,4832,5067,507,5071,5072,511,512,5307,5311,5312,5547,5551,5552,5787,5791,5792,61,61_10,61_11,61_12,61_13,61_14,61_15,61_16,61_17,61_18,61_19,61_2,61_20,61_21,61_22,61_23,61_24,61_3,61_4,61_5,61_6,61_7,61_8,61_9,62,63,63_10,63_11,63_12,63_13,63_14,63_15,63_16,63_17,63_18,63_19,63_2,63_20,63_21,63_22,63_23,63_24,63_3,63_4,63_5,63_6,63_7,63_8,63_9,67_1,747,751,752,78,78_10,78_11,78_12,78_13,78_14,78_15,78_16,78_17,78_18,78_19,78_2,78_20,78_21,78_22,78_23,78_24,78_3,78_4,78_5,78_6,78_7,78_8,78_9,80,80_10,80_11,80_12,80_13,80_14,80_15,80_16,80_17,80_18,80_19,80_2,80_20,80_21,80_22,80_23,80_24,80_3,80_4,80_5,80_6,80_7,80_8,80_9,987,991,992">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="__module.transformer.roberta.embeddings/aten::zeros/Broadcast" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="103_1">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="__module.transformer.roberta.embeddings.token_type_embeddings/aten::embedding/Convert" type="Convert" version="opset1">
			<data destination_type="i32" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="__module.transformer.roberta.embeddings.token_type_embeddings/aten::embedding/Constant" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="10" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="98" name="__module.transformer.roberta.embeddings.token_type_embeddings/aten::embedding/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="FP32" names="131,task_token_type_embeddings">
					<dim>-1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="__module.transformer.roberta.embeddings/aten::add/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="137_1">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="__module.transformer.roberta.embeddings/aten::index_put_/Broadcast_1" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="__module.transformer.roberta.embeddings/aten::index_put_/ScatterNDUpdate_1" type="ScatterNDUpdate" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="I64">
					<dim>-1</dim>
					<dim>1</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32" names="101_1">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="__module.transformer.roberta.emb_ln/aten::layer_norm/Multiply" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="22" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="__module.transformer.roberta.emb_ln/aten::layer_norm/MVN" type="MVN" version="opset6">
			<data eps="9.9999997473787516e-06" normalize_variance="true" eps_mode="INSIDE_SQRT" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="Constant_667477_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1024" offset="514022610" size="2048" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="Constant_667477" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="__module.transformer.roberta.emb_ln/aten::layer_norm/Multiply_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="Constant_667478_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1024" offset="514024658" size="2048" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="Constant_667478" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="__module.transformer.roberta.emb_ln/aten::layer_norm/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="143_1">
