{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<cls>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<sep>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "<mask>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "Sequence",
    "normalizers": [
      {
        "type": "Lowercase"
      },
      {
        "type": "NFC"
      },
      {
        "type": "StripAccents"
      },
      {
        "type": "Replace",
        "pattern": {
          "Regex": "\\s+"
        },
        "content": " "
      },
      {
        "type": "Strip",
        "strip_left": true,
        "strip_right": true
      }
    ]
  },
  "pre_tokenizer": {
    "type": "Sequence",
    "pretokenizers": [
      {
        "type": "Digits",
        "individual_digits": true
      },
      {
        "type": "ByteLevel",
        "add_prefix_space": false,
        "trim_offsets": true,
        "use_regex": true
      }
    ]
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "<cls>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "<sep>",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "SpecialToken": {
          "id": "<cls>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "<sep>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      },
      {
        "SpecialToken": {
          "id": "<sep>",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "<cls>": {
        "id": "<cls>",
        "ids": [
          1
        ],
        "tokens": [
          "<cls>"
        ]
      },
      "<sep>": {
        "id": "<sep>",
        "ids": [
          2
        ],
        "tokens": [
          "<sep>"
        ]
      }
    }
  },
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "<unk>",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "<pad>": 0,
      "<cls>": 1,
      "<sep>": 2,
      "<unk>": 3,
      "<mask>": 4,
      ".": 5,
      "1": 6,
      "2": 7,
      "3": 8,
      "8": 9,
      ">": 10,
      "a": 11,
      "e": 12,
      "g": 13,
      "h": 14,
      "i": 15,
      "n": 16,
      "o": 17,
      "p": 18,
      "r": 19,
      "s": 20,
      "t": 21,
      "w": 22,
      "y": 23,
      "¡": 24,
      "¢": 25,
      "¤": 26,
      "¦": 27,
      "§": 28,
      "©": 29,
      "«": 30,
      "¯": 31,
      "±": 32,
      "³": 33,
      "·": 34,
      "¸": 35,
      "º": 36,
      "»": 37,
      "¼": 38,
      "½": 39,
      "¾": 40,
      "¿": 41,
      "ã": 42,
      "ä": 43,
      "å": 44,
      "æ": 45,
      "ç": 46,
      "è": 47,
      "é": 48,
      "ï": 49,
      "Ġ": 50,
      "Ģ": 51,
      "ģ": 52,
      "Ĥ": 53,
      "ĥ": 54,
      "Ħ": 55,
      "ħ": 56,
      "ĩ": 57,
      "Ī": 58,
      "ī": 59,
      "Ĭ": 60,
      "Į": 61,
      "į": 62,
      "İ": 63,
      "ı": 64,
      "Ĳ": 65,
      "ĳ": 66,
      "Ĵ": 67,
      "ĸ": 68,
      "ĺ": 69,
      "Ļ": 70,
      "ļ": 71,
      "Ŀ": 72,
      "Ł": 73,
      "ł": 74,
      "ï¼": 75,
      "ä½": 76,
      "åŁ": 77,
      "åŁº": 78,
      "th": 79,
      "§è": 80,
      "¯ç": 81,
      "æĢ": 82,
      "èĬ": 83,
      "ĥ½": 84,
      "ĩæĢ": 85,
      "īĩæĢ": 86,
      "ļä½": 87,
      "§èĥ½": 88,
      "¯çīĩæĢ": 89,
      "èĬ¯çīĩæĢ": 90,
      "èĬ¯çīĩæĢ§èĥ½": 91,
      "on": 92,
      "py": 93,
      "¡ħ": 94,
      "¢³": 95,
      "©ä": 96,
      "«ĺ": 97,
      "¸©ä": 98,
      "¼ļä½": 99,
      "¿ç": 100,
      "æ¸©ä": 101,
      "çļ": 102,
      "é«ĺ": 103,
      "ï¼İ": 104,
      "ï¼ĳ": 105,
      "ï¼Ļ": 106,
      "ä½İ": 107,
      "åŁºèĬ¯çīĩæĢ§èĥ½": 108,
      "thon": 109,
      "python": 110,
      "¼ļä½¿ç": 111,
      "æ¸©ä¼ļä½¿ç": 112,
      "çļĦ": 113,
      "an": 114,
      "er": 115,
      "ew": 116,
      "go": 117,
      "is": 118,
      "new": 119,
      "¤ļä½": 120,
      "¦ģ": 121,
      "©º": 122,
      "¯ä": 123,
      "±å": 124,
      "·é": 125,
      "¸į": 126,
      "»·é": 127,
      "¾Ī": 128,
      "ãĢ": 129,
      "ä»·é": 130,
      "åĲ": 131,
      "åĴ": 132,
      "å¤ļä½": 133,
      "å¾Ī": 134,
      "æı": 135,
      "æĸ": 136,
      "æĺ": 137,
      "æĿ": 138,
      "æł": 139,
      "ç¡ħ": 140,
      "ç¢³": 141,
      "ç©º": 142,
      "è¦ģ": 143,
      "éĩ": 144,
      "éĻ": 145,
      "Ġ>": 146,
      "Ġth": 147,
      "Ġpython": 148,
      "Ġgo": 149
    },
    "merges": [
      [
        "ï",
        "¼"
      ],
      [
        "ä",
        "½"
      ],
      [
        "å",
        "Ł"
      ],
      [
        "åŁ",
        "º"
      ],
      [
        "t",
        "h"
      ],
      [
        "§",
        "è"
      ],
      [
        "¯",
        "ç"
      ],
      [
        "æ",
        "Ģ"
      ],
      [
        "è",
        "Ĭ"
      ],
      [
        "ĥ",
        "½"
      ],
      [
        "ĩ",
        "æĢ"
      ],
      [
        "ī",
        "ĩæĢ"
      ],
      [
        "ļ",
        "ä½"
      ],
      [
        "§è",
        "ĥ½"
      ],
      [
        "¯ç",
        "īĩæĢ"
      ],
      [
        "èĬ",
        "¯çīĩæĢ"
      ],
      [
        "èĬ¯çīĩæĢ",
        "§èĥ½"
      ],
      [
        "o",
        "n"
      ],
      [
        "p",
        "y"
      ],
      [
        "¡",
        "ħ"
      ],
      [
        "¢",
        "³"
      ],
      [
        "©",
        "ä"
      ],
      [
        "«",
        "ĺ"
      ],
      [
        "¸",
        "©ä"
      ],
      [
        "¼",
        "ļä½"
      ],
      [
        "¿",
        "ç"
      ],
      [
        "æ",
        "¸©ä"
      ],
      [
        "ç",
        "ļ"
      ],
      [
        "é",
        "«ĺ"
      ],
      [
        "ï¼",
        "İ"
      ],
      [
        "ï¼",
        "ĳ"
      ],
      [
        "ï¼",
        "Ļ"
      ],
      [
        "ä½",
        "İ"
      ],
      [
        "åŁº",
        "èĬ¯çīĩæĢ§èĥ½"
      ],
      [
        "th",
        "on"
      ],
      [
        "py",
        "thon"
      ],
      [
        "¼ļä½",
        "¿ç"
      ],
      [
        "æ¸©ä",
        "¼ļä½¿ç"
      ],
      [
        "çļ",
        "Ħ"
      ],
      [
        "a",
        "n"
      ],
      [
        "e",
        "r"
      ],
      [
        "e",
        "w"
      ],
      [
        "g",
        "o"
      ],
      [
        "i",
        "s"
      ],
      [
        "n",
        "ew"
      ],
      [
        "¤",
        "ļä½"
      ],
      [
        "¦",
        "ģ"
      ],
      [
        "©",
        "º"
      ],
      [
        "¯",
        "ä"
      ],
      [
        "±",
        "å"
      ],
      [
        "·",
        "é"
      ],
      [
        "¸",
        "į"
      ],
      [
        "»",
        "·é"
      ],
      [
        "¾",
        "Ī"
      ],
      [
        "ã",
        "Ģ"
      ],
      [
        "ä",
        "»·é"
      ],
      [
        "å",
        "Ĳ"
      ],
      [
        "å",
        "Ĵ"
      ],
      [
        "å",
        "¤ļä½"
      ],
      [
        "å",
        "¾Ī"
      ],
      [
        "æ",
        "ı"
      ],
      [
        "æ",
        "ĸ"
      ],
      [
        "æ",
        "ĺ"
      ],
      [
        "æ",
        "Ŀ"
      ],
      [
        "æ",
        "ł"
      ],
      [
        "ç",
        "¡ħ"
      ],
      [
        "ç",
        "¢³"
      ],
      [
        "ç",
        "©º"
      ],
      [
        "è",
        "¦ģ"
      ],
      [
        "é",
        "ĩ"
      ],
      [
        "é",
        "Ļ"
      ],
      [
        "Ġ",
        ">"
      ],
      [
        "Ġ",
        "th"
      ],
      [
        "Ġ",
        "python"
      ],
      [
        "Ġ",
        "go"
      ]
    ]
  }
}