{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "[CLS]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "SpecialToken": {
          "id": "[CLS]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 0
        }
      }
    ],
    "special_tokens": {
      "[CLS]": {
        "id": "[CLS]",
        "ids": [
          1
        ],
        "tokens": [
          "[CLS]"
        ]
      },
      "[SEP]": {
        "id": "[SEP]",
        "ids": [
          2
        ],
        "tokens": [
          "[SEP]"
        ]
      }
    }
  },
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "[UNK]",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "[UNK]": 0,
      "[CLS]": 1,
      "[SEP]": 2,
      "[PAD]": 3,
      "[MASK]": 4,
      "A": 5,
      "B": 6,
      "E": 7,
      "G": 8,
      "I": 9,
      "L": 10,
      "M": 11,
      "N": 12,
      "P": 13,
      "R": 14,
      "T": 15,
      "a": 16,
      "e": 17,
      "f": 18,
      "i": 19,
      "k": 20,
      "m": 21,
      "n": 22,
      "o": 23,
      "r": 24,
      "s": 25,
      "t": 26,
      "z": 27,
      "、": 28,
      "。": 29,
      "一": 30,
      "三": 31,
      "上": 32,
      "下": 33,
      "不": 34,
      "与": 35,
      "专": 36,
      "且": 37,
      "两": 38,
      "个": 39,
      "中": 40,
      "丰": 41,
      "为": 42,
      "主": 43,
      "久": 44,
      "义": 45,
      "之": 46,
      "乐": 47,
      "也": 48,
      "习": 49,
      "书": 50,
      "了": 51,
      "事": 52,
      "于": 53,
      "互": 54,
      "些": 55,
      "交": 56,
      "人": 57,
      "从": 58,
      "代": 59,
      "以": 60,
      "们": 61,
      "件": 62,
      "价": 63,
      "任": 64,
      "优": 65,
      "会": 66,
      "伦": 67,
      "估": 68,
      "似": 69,
      "但": 70,
      "位": 71,
      "低": 72,
      "体": 73,
      "何": 74,
      "作": 75,
      "使": 76,
      "依": 77,
      "促": 78,
      "保": 79,
      "信": 80,
      "值": 81,
      "偏": 82,
      "储": 83,
      "像": 84,
      "允": 85,
      "元": 86,
      "充": 87,
      "入": 88,
      "全": 89,
      "共": 90,
      "关": 91,
      "兴": 92,
      "其": 93,
      "具": 94,
      "内": 95,
      "写": 96,
      "决": 97,
      "净": 98,
      "准": 99,
      "减": 100,
      "出": 101,
      "分": 102,
      "切": 103,
      "列": 104,
      "则": 105,
      "创": 106,
      "判": 107,
      "利": 108,
      "别": 109,
      "到": 110,
      "制": 111,
      "前": 112,
      "力": 113,
      "功": 114,
      "务": 115,
      "动": 116,
      "势": 117,
      "包": 118,
      "化": 119,
      "匹": 120,
      "协": 121,
      "单": 122,
      "卷": 123,
      "历": 124,
      "压": 125,
      "原": 126,
      "参": 127,
      "及": 128,
      "发": 129,
      "取": 130,
      "受": 131,
      "变": 132,
      "口": 133,
      "句": 134,
      "另": 135,
      "只": 136,
      "可": 137,
      "史": 138,
      "号": 139,
      "各": 140,
      "合": 141,
      "同": 142,
      "名": 143,
      "向": 144,
      "否": 145,
      "含": 146,
      "启": 147,
      "命": 148,
      "和": 149,
      "响": 150,
      "器": 151,
      "回": 152,
      "因": 153,
      "国": 154,
      "图": 155,
      "在": 156,
      "地": 157,
      "场": 158,
      "圾": 159,
      "垃": 160,
      "型": 161,
      "域": 162,
      "基": 163,
      "境": 164,
      "增": 165,
      "处": 166,
      "备": 167,
      "复": 168,
      "外": 169,
      "多": 170,
      "够": 171,
      "大": 172,
      "头": 173,
      "好": 174,
      "如": 175,
      "始": 176,
      "娱": 177,
      "媒": 178,
      "子": 179,
      "字": 180,
      "存": 181,
      "学": 182,
      "它": 183,
      "安": 184,
      "完": 185,
      "定": 186,
      "实": 187,
      "家": 188,
      "容": 189,
      "富": 190,
      "对": 191,
      "导": 192,
      "射": 193,
      "将": 194,
      "小": 195,
      "少": 196,
      "尤": 197,
      "就": 198,
      "层": 199,
      "展": 200,
      "嵌": 201,
      "工": 202,
      "巨": 203,
      "已": 204,
      "市": 205,
      "常": 206,
      "干": 207,
      "平": 208,
      "年": 209,
      "并": 210,
      "幻": 211,
      "广": 212,
      "序": 213,
      "库": 214,
      "应": 215,
      "度": 216,
      "建": 217,
      "开": 218,
      "式": 219,
      "引": 220,
      "强": 221,
      "归": 222,
      "当": 223,
      "形": 224,
      "影": 225,
      "径": 226,
      "得": 227,
      "循": 228,
      "微": 229,
      "快": 230,
      "态": 231,
      "思": 232,
      "性": 233,
      "息": 234,
      "悠": 235,
      "情": 236,
      "意": 237,
      "感": 238,
      "戏": 239,
      "成": 240,
      "我": 241,
      "或": 242,
      "战": 243,
      "户": 244,
      "所": 245,
      "扩": 246,
      "找": 247,
      "技": 248,
      "抗": 249,
      "护": 250,
      "抽": 251,
      "拆": 252,
      "拟": 253,
      "拥": 254,
      "择": 255,
      "括": 256,
      "拼": 257,
      "持": 258,
      "指": 259,
      "挑": 260,
      "捉": 261,
      "捕": 262,
      "换": 263,
      "据": 264,
      "排": 265,
      "探": 266,
      "接": 267,
      "推": 268,
      "描": 269,
      "提": 270,
      "搜": 271,
      "摘": 272,
      "支": 273,
      "收": 274,
      "放": 275,
      "效": 276,
      "敏": 277,
      "数": 278,
      "整": 279,
      "文": 280,
      "断": 281,
      "新": 282,
      "方": 283,
      "无": 284,
      "旨": 285,
      "时": 286,
      "明": 287,
      "映": 288,
      "是": 289,
      "显": 290,
      "景": 291,
      "智": 292,
      "更": 293,
      "最": 294,
      "有": 295,
      "未": 296,
      "本": 297,
      "术": 298,
      "机": 299,
      "杂": 300,
      "条": 301,
      "来": 302,
      "极": 303,
      "构": 304,
      "析": 305,
      "果": 306,
      "架": 307,
      "查": 308,
      "标": 309,
      "树": 310,
      "样": 311,
      "根": 312,
      "案": 313,
      "档": 314,
      "检": 315,
      "棒": 316,
      "模": 317,
      "正": 318,
      "步": 319,
      "歧": 320,
      "殊": 321,
      "段": 322,
      "每": 323,
      "比": 324,
      "民": 325,
      "求": 326,
      "汇": 327,
      "汉": 328,
      "没": 329,
      "沿": 330,
      "法": 331,
      "泛": 332,
      "注": 333,
      "洁": 334,
      "活": 335,
      "流": 336,
      "测": 337,
      "消": 338,
      "涉": 339,
      "深": 340,
      "混": 341,
      "游": 342,
      "源": 343,
      "滤": 344,
      "潜": 345,
      "灿": 346,
      "点": 347,
      "烂": 348,
      "然": 349,
      "特": 350,
      "率": 351,
      "环": 352,
      "现": 353,
      "理": 354,
      "生": 355,
      "用": 356,
      "畅": 357,
      "略": 358,
      "的": 359,
      "监": 360,
      "目": 361,
      "直": 362,
      "相": 363,
      "看": 364,
      "真": 365,
      "着": 366,
      "督": 367,
      "知": 368,
      "短": 369,
      "码": 370,
      "研": 371,
      "破": 372,
      "础": 373,
      "确": 374,
      "碳": 375,
      "示": 376,
      "社": 377,
      "神": 378,
      "私": 379,
      "种": 380,
      "积": 381,
      "移": 382,
      "稀": 383,
      "程": 384,
      "究": 385,
      "空": 386,
      "突": 387,
      "窗": 388,
      "符": 389,
      "第": 390,
      "等": 391,
      "答": 392,
      "策": 393,
      "简": 394,
      "算": 395,
      "类": 396,
      "精": 397,
      "系": 398,
      "索": 399,
      "纠": 400,
      "练": 401,
      "组": 402,
      "织": 403,
      "终": 404,
      "经": 405,
      "结": 406,
      "络": 407,
      "统": 408,
      "续": 409,
      "维": 410,
      "编": 411,
      "缩": 412,
      "缺": 413,
      "网": 414,
      "翻": 415,
      "考": 416,
      "耗": 417,
      "胜": 418,
      "能": 419,
      "脑": 420,
      "自": 421,
      "至": 422,
      "节": 423,
      "英": 424,
      "荐": 425,
      "获": 426,
      "蒸": 427,
      "虚": 428,
      "虽": 429,
      "融": 430,
      "行": 431,
      "衡": 432,
      "补": 433,
      "表": 434,
      "被": 435,
      "要": 436,
      "见": 437,
      "观": 438,
      "规": 439,
      "觉": 440,
      "解": 441,
      "言": 442,
      "计": 443,
      "训": 444,
      "记": 445,
      "许": 446,
      "设": 447,
      "证": 448,
      "评": 449,
      "识": 450,
      "词": 451,
      "译": 452,
      "话": 453,
      "询": 454,
      "语": 455,
      "误": 456,
      "调": 457,
      "谱": 458,
      "象": 459,
      "负": 460,
      "责": 461,
      "质": 462,
      "贯": 463,
      "资": 464,
      "赖": 465,
      "趣": 466,
      "跨": 467,
      "身": 468,
      "转": 469,
      "轮": 470,
      "软": 471,
      "输": 472,
      "达": 473,
      "迁": 474,
      "过": 475,
      "近": 476,
      "返": 477,
      "这": 478,
      "进": 479,
      "连": 480,
      "述": 481,
      "适": 482,
      "选": 483,
      "透": 484,
      "途": 485,
      "通": 486,
      "速": 487,
      "造": 488,
      "逼": 489,
      "邮": 490,
      "部": 491,
      "配": 492,
      "释": 493,
      "重": 494,
      "量": 495,
      "链": 496,
      "错": 497,
      "键": 498,
      "长": 499,
      "门": 500,
      "问": 501,
      "间": 502,
      "阶": 503,
      "际": 504,
      "降": 505,
      "限": 506,
      "隐": 507,
      "隔": 508,
      "集": 509,
      "零": 510,
      "需": 511,
      "非": 512,
      "靠": 513,
      "面": 514,
      "音": 515,
      "预": 516,
      "领": 517,
      "题": 518,
      "馈": 519,
      "馏": 520,
      "高": 521,
      "鲁": 522,
      "齐": 523,
      "（": 524,
      "）": 525,
      "，": 526,
      "模型": 527,
      "语言": 528,
      "文本": 529,
      "学习": 530,
      "生成": 531,
      "技术": 532,
      "数据": 533,
      "能够": 534,
      "处理": 535,
      "系统": 536,
      "语言模型": 537,
      "AI": 538,
      "知识": 539,
      "一种": 540,
      "训练": 541,
      "任务": 542,
      "提高": 543,
      "理解": 544,
      "能力": 545,
      "重要": 546,
      "信息": 547,
      "可以": 548,
      "结构": 549,
      "网络": 550,
      "计算": 551,
      "输入": 552,
      "通过": 553,
      "AI系统": 554,
      "人工": 555,
      "应用": 556,
      "是一种": 557,
      "智能": 558,
      "的重要": 559,
      "研究": 560,
      "自然": 561,
      "语义": 562,
      "一个": 563,
      "人类": 564,
      "减少": 565,
      "实体": 566,
      "提示": 567,
      "检索": 568,
      "用户": 569,
      "神经": 570,
      "过程": 571,
      "模型的": 572,
      "人工智能": 573,
      "自然语言": 574,
      "上下": 575,
      "中文": 576,
      "中的": 577,
      "之间": 578,
      "交互": 579,
      "关系": 580,
      "分析": 581,
      "分词": 582,
      "包含": 583,
      "如何": 584,
      "性能": 585,
      "情感": 586,
      "推理": 587,
      "方式": 588,
      "是将": 589,
      "机器": 590,
      "自动": 591,
      "识别": 592,
      "部分": 593,
      "预训练": 594,
      "领域": 595,
      "语言的": 596,
      "AI系统的": 597,
      "应用于": 598,
      "研究如何": 599,
      "神经网络": 600,
      "上下文": 601,
      "之间的": 602,
      "一步": 603,
      "不同": 604,
      "专家": 605,
      "义的": 606,
      "之一": 607,
      "人机": 608,
      "使用": 609,
      "允许": 610,
      "关键": 611,
      "内容": 612,
      "同时": 613,
      "增强": 614,
      "大小": 615,
      "实现": 616,
      "对话": 617,
      "广泛": 618,
      "序列": 619,
      "影响": 620,
      "意力": 621,
      "提取": 622,
      "文档": 623,
      "是人工智能": 624,
      "标注": 625,
      "标记": 626,
      "样本": 627,
      "注意力": 628,
      "特定": 629,
      "监督": 630,
      "符合": 631,
      "编码": 632,
      "行为": 633,
      "表示": 634,
      "语音": 635,
      "质量": 636,
      "资源": 637,
      "适应": 638,
      "问题": 639,
      "需求": 640,
      "模型能够": 641,
      "文本中": 642,
      "学习模型": 643,
      "技术的": 644,
      "技术可以": 645,
      "系统能够": 646,
      "知识库": 647,
      "任务的": 648,
      "结构化": 649,
      "计算机": 650,
      "自然语言处理": 651,
      "广泛应用于": 652,
      "Tr": 653,
      "an": 654,
      "er": 655,
      "fo": 656,
      "mer": 657,
      "rmer": 658,
      "sfo": 659,
      "与词": 660,
      "且符合": 661,
      "两个": 662,
      "个专家": 663,
      "价值": 664,
      "优化": 665,
      "使模型能够": 666,
      "依赖": 667,
      "促进": 668,
      "保AI系统的": 669,
      "关注": 670,
      "出的": 671,
      "分成": 672,
      "分配": 673,
      "利用": 674,
      "包括": 675,
      "单元": 676,
      "历史": 677,
      "参数": 678,
      "发展": 679,
      "取得": 680,
      "句法": 681,
      "另一种": 682,
      "可理解": 683,
      "合理": 684,
      "向量": 685,
      "图像": 686,
      "在保": 687,
      "型的": 688,
      "基于": 689,
      "基础": 690,
      "复杂": 691,
      "外部": 692,
      "大语言模型": 693,
      "好的": 694,
      "存储": 695,
      "对抗": 696,
      "工作": 697,
      "工具": 698,
      "微调": 699,
      "思考": 700,
      "性和": 701,
      "意义的": 702,
      "我们": 703,
      "或生成": 704,
      "持续": 705,
      "指代": 706,
      "捕捉": 707,
      "推荐": 708,
      "摘要": 709,
      "效率": 710,
      "方法": 711,
      "旨在": 712,
      "是指": 713,
      "是语言模型": 714,
      "更小": 715,
      "更好的": 716,
      "有限": 717,
      "有意义的": 718,
      "机制": 719,
      "构的": 720,
      "模态": 721,
      "消耗": 722,
      "深度": 723,
      "的文本": 724,
      "的知识": 725,
      "的关键": 726,
      "的内容": 727,
      "的同时": 728,
      "相似": 729,
      "相关": 730,
      "确保AI系统的": 731,
      "类别": 732,
      "类型的": 733,
      "编写": 734,
      "翻译": 735,
      "词语": 736,
      "词与词": 737,
      "语法": 738,
      "负责": 739,
      "责任": 740,
      "跨语言": 741,
      "输出的": 742,
      "迁移": 743,
      "透明": 744,
      "错误": 745,
      "需要": 746,
      "预测": 747,
      "高效": 748,
      "模型中": 749,
      "模型推理": 750,
      "文本分": 751,
      "文本的": 752,
      "学习和": 753,
      "学习研究如何": 754,
      "数据的": 755,
      "处理的": 756,
      "语言模型能够": 757,
      "AI技术的": 758,
      "一种语言的": 759,
      "任务上": 760,
      "理解用户": 761,
      "信息检索": 762,
      "输入提示": 763,
      "人类价值": 764,
      "减少对": 765,
      "模型的知识": 766,
      "包含多": 767,
      "性能的同时": 768,
      "情感分析": 769,
      "预训练模型": 770,
      "大小和": 771,
      "对话系统": 772,
      "标记化": 773,
      "注意力机制": 774,
      "适应新": 775,
      "Tran": 776,
      "sformer": 777,
      "促进了": 778,
      "分成有意义的": 779,
      "取得了": 780,
      "另一种语言": 781,
      "确保AI系统的行为": 782,
      "词与词之间的": 783,
      "人类价值观": 784,
      "性能的同时减少": 785,
      "Transformer": 786
    },
    "merges": [
      [
        "模",
        "型"
      ],
      [
        "语",
        "言"
      ],
      [
        "文",
        "本"
      ],
      [
        "学",
        "习"
      ],
      [
        "生",
        "成"
      ],
      [
        "技",
        "术"
      ],
      [
        "数",
        "据"
      ],
      [
        "能",
        "够"
      ],
      [
        "处",
        "理"
      ],
      [
        "系",
        "统"
      ],
      [
        "语言",
        "模型"
      ],
      [
        "A",
        "I"
      ],
      [
        "知",
        "识"
      ],
      [
        "一",
        "种"
      ],
      [
        "训",
        "练"
      ],
      [
        "任",
        "务"
      ],
      [
        "提",
        "高"
      ],
      [
        "理",
        "解"
      ],
      [
        "能",
        "力"
      ],
      [
        "重",
        "要"
      ],
      [
        "信",
        "息"
      ],
      [
        "可",
        "以"
      ],
      [
        "结",
        "构"
      ],
      [
        "网",
        "络"
      ],
      [
        "计",
        "算"
      ],
      [
        "输",
        "入"
      ],
      [
        "通",
        "过"
      ],
      [
        "AI",
        "系统"
      ],
      [
        "人",
        "工"
      ],
      [
        "应",
        "用"
      ],
      [
        "是",
        "一种"
      ],
      [
        "智",
        "能"
      ],
      [
        "的",
        "重要"
      ],
      [
        "研",
        "究"
      ],
      [
        "自",
        "然"
      ],
      [
        "语",
        "义"
      ],
      [
        "一",
        "个"
      ],
      [
        "人",
        "类"
      ],
      [
        "减",
        "少"
      ],
      [
        "实",
        "体"
      ],
      [
        "提",
        "示"
      ],
      [
        "检",
        "索"
      ],
      [
        "用",
        "户"
      ],
      [
        "神",
        "经"
      ],
      [
        "过",
        "程"
      ],
      [
        "模型",
        "的"
      ],
      [
        "人工",
        "智能"
      ],
      [
        "自然",
        "语言"
      ],
      [
        "上",
        "下"
      ],
      [
        "中",
        "文"
      ],
      [
        "中",
        "的"
      ],
      [
        "之",
        "间"
      ],
      [
        "交",
        "互"
      ],
      [
        "关",
        "系"
      ],
      [
        "分",
        "析"
      ],
      [
        "分",
        "词"
      ],
      [
        "包",
        "含"
      ],
      [
        "如",
        "何"
      ],
      [
        "性",
        "能"
      ],
      [
        "情",
        "感"
      ],
      [
        "推",
        "理"
      ],
      [
        "方",
        "式"
      ],
      [
        "是",
        "将"
      ],
      [
        "机",
        "器"
      ],
      [
        "自",
        "动"
      ],
      [
        "识",
        "别"
      ],
      [
        "部",
        "分"
      ],
      [
        "预",
        "训练"
      ],
      [
        "领",
        "域"
      ],
      [
        "语言",
        "的"
      ],
      [
        "AI系统",
        "的"
      ],
      [
        "应用",
        "于"
      ],
      [
        "研究",
        "如何"
      ],
      [
        "神经",
        "网络"
      ],
      [
        "上下",
        "文"
      ],
      [
        "之间",
        "的"
      ],
      [
        "一",
        "步"
      ],
      [
        "不",
        "同"
      ],
      [
        "专",
        "家"
      ],
      [
        "义",
        "的"
      ],
      [
        "之",
        "一"
      ],
      [
        "人",
        "机"
      ],
      [
        "使",
        "用"
      ],
      [
        "允",
        "许"
      ],
      [
        "关",
        "键"
      ],
      [
        "内",
        "容"
      ],
      [
        "同",
        "时"
      ],
      [
        "增",
        "强"
      ],
      [
        "大",
        "小"
      ],
      [
        "实",
        "现"
      ],
      [
        "对",
        "话"
      ],
      [
        "广",
        "泛"
      ],
      [
        "序",
        "列"
      ],
      [
        "影",
        "响"
      ],
      [
        "意",
        "力"
      ],
      [
        "提",
        "取"
      ],
      [
        "文",
        "档"
      ],
      [
        "是",
        "人工智能"
      ],
      [
        "标",
        "注"
      ],
      [
        "标",
        "记"
      ],
      [
        "样",
        "本"
      ],
      [
        "注",
        "意力"
      ],
      [
        "特",
        "定"
      ],
      [
        "监",
        "督"
      ],
      [
        "符",
        "合"
      ],
      [
        "编",
        "码"
      ],
      [
        "行",
        "为"
      ],
      [
        "表",
        "示"
      ],
      [
        "语",
        "音"
      ],
      [
        "质",
        "量"
      ],
      [
        "资",
        "源"
      ],
      [
        "适",
        "应"
      ],
      [
        "问",
        "题"
      ],
      [
        "需",
        "求"
      ],
      [
        "模型",
        "能够"
      ],
      [
        "文本",
        "中"
      ],
      [
        "学习",
        "模型"
      ],
      [
        "技术",
        "的"
      ],
      [
        "技术",
        "可以"
      ],
      [
        "系统",
        "能够"
      ],
      [
        "知识",
        "库"
      ],
      [
        "任务",
        "的"
      ],
      [
        "结构",
        "化"
      ],
      [
        "计算",
        "机"
      ],
      [
        "自然语言",
        "处理"
      ],
      [
        "广泛",
        "应用于"
      ],
      [
        "T",
        "r"
      ],
      [
        "a",
        "n"
      ],
      [
        "e",
        "r"
      ],
      [
        "f",
        "o"
      ],
      [
        "m",
        "er"
      ],
      [
        "r",
        "mer"
      ],
      [
        "s",
        "fo"
      ],
      [
        "与",
        "词"
      ],
      [
        "且",
        "符合"
      ],
      [
        "两",
        "个"
      ],
      [
        "个",
        "专家"
      ],
      [
        "价",
        "值"
      ],
      [
        "优",
        "化"
      ],
      [
        "使",
        "模型能够"
      ],
      [
        "依",
        "赖"
      ],
      [
        "促",
        "进"
      ],
      [
        "保",
        "AI系统的"
      ],
      [
        "关",
        "注"
      ],
      [
        "出",
        "的"
      ],
      [
        "分",
        "成"
      ],
      [
        "分",
        "配"
      ],
      [
        "利",
        "用"
      ],
      [
        "包",
        "括"
      ],
      [
        "单",
        "元"
      ],
      [
        "历",
        "史"
      ],
      [
        "参",
        "数"
      ],
      [
        "发",
        "展"
      ],
      [
        "取",
        "得"
      ],
      [
        "句",
        "法"
      ],
      [
        "另",
        "一种"
      ],
      [
        "可",
        "理解"
      ],
      [
        "合",
        "理"
      ],
      [
        "向",
        "量"
      ],
      [
        "图",
        "像"
      ],
      [
        "在",
        "保"
      ],
      [
        "型",
        "的"
      ],
      [
        "基",
        "于"
      ],
      [
        "基",
        "础"
      ],
      [
        "复",
        "杂"
      ],
      [
        "外",
        "部"
      ],
      [
        "大",
        "语言模型"
      ],
      [
        "好",
        "的"
      ],
      [
        "存",
        "储"
      ],
      [
        "对",
        "抗"
      ],
      [
        "工",
        "作"
      ],
      [
        "工",
        "具"
      ],
      [
        "微",
        "调"
      ],
      [
        "思",
        "考"
      ],
      [
        "性",
        "和"
      ],
      [
        "意",
        "义的"
      ],
      [
        "我",
        "们"
      ],
      [
        "或",
        "生成"
      ],
      [
        "持",
        "续"
      ],
      [
        "指",
        "代"
      ],
      [
        "捕",
        "捉"
      ],
      [
        "推",
        "荐"
      ],
      [
        "摘",
        "要"
      ],
      [
        "效",
        "率"
      ],
      [
        "方",
        "法"
      ],
      [
        "旨",
        "在"
      ],
      [
        "是",
        "指"
      ],
      [
        "是",
        "语言模型"
      ],
      [
        "更",
        "小"
      ],
      [
        "更",
        "好的"
      ],
      [
        "有",
        "限"
      ],
      [
        "有",
        "意义的"
      ],
      [
        "机",
        "制"
      ],
      [
        "构",
        "的"
      ],
      [
        "模",
        "态"
      ],
      [
        "消",
        "耗"
      ],
      [
        "深",
        "度"
      ],
      [
        "的",
        "文本"
      ],
      [
        "的",
        "知识"
      ],
      [
        "的",
        "关键"
      ],
      [
        "的",
        "内容"
      ],
      [
        "的",
        "同时"
      ],
      [
        "相",
        "似"
      ],
      [
        "相",
        "关"
      ],
      [
        "确",
        "保AI系统的"
      ],
      [
        "类",
        "别"
      ],
      [
        "类",
        "型的"
      ],
      [
        "编",
        "写"
      ],
      [
        "翻",
        "译"
      ],
      [
        "词",
        "语"
      ],
      [
        "词",
        "与词"
      ],
      [
        "语",
        "法"
      ],
      [
        "负",
        "责"
      ],
      [
        "责",
        "任"
      ],
      [
        "跨",
        "语言"
      ],
      [
        "输",
        "出的"
      ],
      [
        "迁",
        "移"
      ],
      [
        "透",
        "明"
      ],
      [
        "错",
        "误"
      ],
      [
        "需",
        "要"
      ],
      [
        "预",
        "测"
      ],
      [
        "高",
        "效"
      ],
      [
        "模型",
        "中"
      ],
      [
        "模型",
        "推理"
      ],
      [
        "文本",
        "分"
      ],
      [
        "文本",
        "的"
      ],
      [
        "学习",
        "和"
      ],
      [
        "学习",
        "研究如何"
      ],
      [
        "数据",
        "的"
      ],
      [
        "处理",
        "的"
      ],
      [
        "语言模型",
        "能够"
      ],
      [
        "AI",
        "技术的"
      ],
      [
        "一种",
        "语言的"
      ],
      [
        "任务",
        "上"
      ],
      [
        "理解",
        "用户"
      ],
      [
        "信息",
        "检索"
      ],
      [
        "输入",
        "提示"
      ],
      [
        "人类",
        "价值"
      ],
      [
        "减少",
        "对"
      ],
      [
        "模型的",
        "知识"
      ],
      [
        "包含",
        "多"
      ],
      [
        "性能",
        "的同时"
      ],
      [
        "情感",
        "分析"
      ],
      [
        "预训练",
        "模型"
      ],
      [
        "大小",
        "和"
      ],
      [
        "对话",
        "系统"
      ],
      [
        "标记",
        "化"
      ],
      [
        "注意力",
        "机制"
      ],
      [
        "适应",
        "新"
      ],
      [
        "Tr",
        "an"
      ],
      [
        "sfo",
        "rmer"
      ],
      [
        "促进",
        "了"
      ],
      [
        "分成",
        "有意义的"
      ],
      [
        "取得",
        "了"
      ],
      [
        "另一种",
        "语言"
      ],
      [
        "确保AI系统的",
        "行为"
      ],
      [
        "词与词",
        "之间的"
      ],
      [
        "人类价值",
        "观"
      ],
      [
        "性能的同时",
        "减少"
      ],
      [
        "Tran",
        "sformer"
      ]
    ]
  }
}